#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```terraform

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
module.ecs_backend.data.aws_iam_policy_document.policy_for_access_to_secrets_manager: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_codedeploy: Reading...
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_task_execution_role: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_task_execution_role: Read complete after 0s [id=320642683]
module.ecs_backend.data.aws_iam_policy_document.policy_for_access_to_secrets_manager: Read complete after 0s [id=2388003798]
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_codedeploy: Read complete after 0s [id=1717932134]
data.aws_caller_identity.current: Read complete after 0s [id=919185590838]
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_github_actions: Reading...
module.ecs_backend.data.aws_iam_policy_document.trust_policy_for_github_actions: Read complete after 0s [id=649360937]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb_ingress.aws_lb.ingress will be created
+   resource "aws_lb" "ingress" {
+       arn                                         = (known after apply)
+       arn_suffix                                  = (known after apply)
+       desync_mitigation_mode                      = "defensive"
+       dns_name                                    = (known after apply)
+       drop_invalid_header_fields                  = false
+       enable_deletion_protection                  = false
+       enable_http2                                = true
+       enable_tls_version_and_cipher_suite_headers = false
+       enable_waf_fail_open                        = false
+       enable_xff_client_port                      = false
+       id                                          = (known after apply)
+       idle_timeout                                = 60
+       internal                                    = false
+       ip_address_type                             = (known after apply)
+       load_balancer_type                          = "application"
+       name                                        = "brachio-dev-alb-ingress"
+       preserve_host_header                        = false
+       security_groups                             = (known after apply)
+       subnets                                     = (known after apply)
+       tags                                        = {
+           "Name" = "brachio-dev-alb-ingress"
        }
+       tags_all                                    = {
+           "Name" = "brachio-dev-alb-ingress"
        }
+       vpc_id                                      = (known after apply)
+       xff_header_processing_mode                  = "append"
+       zone_id                                     = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb_ingress.aws_lb_listener.ingress_prd will be created
+   resource "aws_lb_listener" "ingress_prd" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # module.alb_ingress.aws_lb_listener.ingress_test will be created
+   resource "aws_lb_listener" "ingress_test" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 10080
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # module.alb_ingress.aws_lb_target_group.ingress_blue will be created
+   resource "aws_lb_target_group" "ingress_blue" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "brachio-dev-tg-backend-blue"
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = (known after apply)
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check (known after apply)

+       stickiness (known after apply)

+       target_failover (known after apply)
    }

  # module.alb_ingress.aws_lb_target_group.ingress_green will be created
+   resource "aws_lb_target_group" "ingress_green" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "brachio-dev-tg-backend-green"
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = (known after apply)
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check (known after apply)

+       stickiness (known after apply)

+       target_failover (known after apply)
    }

  # module.ecr.aws_ecr_repository.backend will be created
+   resource "aws_ecr_repository" "backend" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "brachio-dev-backend"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "brachio-dev-ecr-backend"
        }
+       tags_all             = {
+           "Name" = "brachio-dev-ecr-backend"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = false
        }
    }

  # module.ecs_backend.data.aws_iam_policy_document.policy_for_github_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy_for_github_actions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecr:GetAuthorizationToken",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "GetAuthorizationToken"
        }
+       statement {
+           actions   = [
+               "ecr:BatchCheckLayerAvailability",
+               "ecr:BatchGetImage",
+               "ecr:CompleteLayerUpload",
+               "ecr:InitiateLayerUpload",
+               "ecr:PutImage",
+               "ecr:UploadLayerPart",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "PushImageOnly"
        }
+       statement {
+           actions   = [
+               "ecs:DescribeTaskDefinition",
+               "ecs:RegisterTaskDefinition",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "RegisterTaskDefinition"
        }
+       statement {
+           actions   = [
+               "ecs:DescribeServices",
+               "ecs:UpdateService",
+               "ecs:UpdateServicePrimaryTaskSet",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "UpdateService"
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "PassRole"

+           condition {
+               test     = "StringLike"
+               values   = [
+                   "ecs-tasks.amazonaws.com",
                ]
+               variable = "iam:PassedToService"
            }
        }
+       statement {
+           actions   = [
+               "codedeploy:CreateDeployment",
+               "codedeploy:GetDeployment",
+               "codedeploy:GetDeploymentConfig",
+               "codedeploy:GetDeploymentGroup",
+               "codedeploy:RegisterApplicationRevision",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:codedeploy:ap-northeast-1:919185590838:deploymentconfig:*",
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "DeployService"
        }
    }

  # module.ecs_backend.aws_cloudwatch_log_group.backend will be created
+   resource "aws_cloudwatch_log_group" "backend" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/ecs/brachio-dev-backend"
+       name_prefix       = (known after apply)
+       retention_in_days = 7
+       skip_destroy      = false
+       tags              = {
+           "Name" = "/ecs/brachio-dev-backend"
        }
+       tags_all          = {
+           "Name" = "/ecs/brachio-dev-backend"
        }
    }

  # module.ecs_backend.aws_codedeploy_app.backend will be created
+   resource "aws_codedeploy_app" "backend" {
+       application_id      = (known after apply)
+       arn                 = (known after apply)
+       compute_platform    = "ECS"
+       github_account_name = (known after apply)
+       id                  = (known after apply)
+       linked_to_github    = (known after apply)
+       name                = "brachio-dev-backend-app"
+       tags_all            = (known after apply)
    }

  # module.ecs_backend.aws_codedeploy_deployment_group.backend will be created
+   resource "aws_codedeploy_deployment_group" "backend" {
+       app_name               = "brachio-dev-backend-app"
+       arn                    = (known after apply)
+       compute_platform       = (known after apply)
+       deployment_config_name = "CodeDeployDefault.ECSAllAtOnce"
+       deployment_group_id    = (known after apply)
+       deployment_group_name  = "brachio-dev-ecs-backend-deployment-group"
+       id                     = (known after apply)
+       service_role_arn       = (known after apply)
+       tags_all               = (known after apply)

+       blue_green_deployment_config {
+           deployment_ready_option {
+               action_on_timeout    = "STOP_DEPLOYMENT"
+               wait_time_in_minutes = 10
            }
+           green_fleet_provisioning_option (known after apply)
+           terminate_blue_instances_on_deployment_success {
+               action                           = "TERMINATE"
+               termination_wait_time_in_minutes = 60
            }
        }

+       deployment_style {
+           deployment_option = "WITH_TRAFFIC_CONTROL"
+           deployment_type   = "BLUE_GREEN"
        }

+       ecs_service {
+           cluster_name = "brachio-dev-backend-cluster"
+           service_name = "brachio-dev-ecs-backend-service"
        }

+       load_balancer_info {
+           target_group_pair_info {
+               prod_traffic_route {
+                   listener_arns = (known after apply)
                }
+               target_group {
+                   name = "brachio-dev-tg-backend-blue"
                }
+               target_group {
+                   name = "brachio-dev-tg-backend-green"
                }
+               test_traffic_route {
+                   listener_arns = (known after apply)
                }
            }
        }
    }

  # module.ecs_backend.aws_ecs_cluster.backend will be created
+   resource "aws_ecs_cluster" "backend" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "brachio-dev-backend-cluster"
+       tags_all           = (known after apply)

+       default_capacity_provider_strategy (known after apply)

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # module.ecs_backend.aws_ecs_service.backend will be created
+   resource "aws_ecs_service" "backend" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 2
+       enable_ecs_managed_tags            = true
+       enable_execute_command             = false
+       health_check_grace_period_seconds  = 120
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "brachio-dev-ecs-backend-service"
+       platform_version                   = "1.4.0"
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       deployment_controller {
+           type = "CODE_DEPLOY"
        }

+       load_balancer {
+           container_name   = "app"
+           container_port   = 80
+           target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # module.ecs_backend.aws_ecs_task_definition.backend will be created
+   resource "aws_ecs_task_definition" "backend" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu                    = 256
+                   essential              = true
+                   image                  = "nginx:latest"
+                   logConfiguration       = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/brachio-dev-backend"
+                           awslogs-region        = "ap-northeast-1"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   memory                 = 512
+                   name                   = "app"
+                   portMappings           = [
+                       {
+                           containerPort = 80
                        },
                    ]
+                   readonlyRootFilesystem = true
                },
            ]
        )
+       cpu                      = "512"
+       execution_role_arn       = (known after apply)
+       family                   = "brachio-dev-backend-def"
+       id                       = (known after apply)
+       memory                   = "1024"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
    }

  # module.ecs_backend.aws_iam_policy.policy_for_access_to_secrets_manager will be created
+   resource "aws_iam_policy" "policy_for_access_to_secrets_manager" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "brachio-dev-GettingSecretsPolicy-backend"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.ecs_backend.aws_iam_policy.policy_for_github_actions will be created
+   resource "aws_iam_policy" "policy_for_github_actions" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "brachio-dev-policy-for-github-actions"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.ecs_backend.aws_iam_role.codedeploy will be created
+   resource "aws_iam_role" "codedeploy" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "codedeploy.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "brachio-dev-role-for-codedeploy"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs_backend.aws_iam_role.github_actions will be created
+   resource "aws_iam_role" "github_actions" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "token.actions.githubusercontent.com:sub" = "repo:yamato0211/brachio-backend:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::919185590838:oidc-provider/token.actions.githubusercontent.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "brachio-dev-role-for-github-actions"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs_backend.aws_iam_role.task_execution_role will be created
+   resource "aws_iam_role" "task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "brachio-dev-task-execution-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs_backend.aws_iam_role_policy_attachment.codedeploy["ecs"] will be created
+   resource "aws_iam_role_policy_attachment" "codedeploy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
+       role       = "brachio-dev-role-for-codedeploy"
    }

  # module.ecs_backend.aws_iam_role_policy_attachment.github_actions["github"] will be created
+   resource "aws_iam_role_policy_attachment" "github_actions" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "brachio-dev-role-for-github-actions"
    }

  # module.ecs_backend.aws_iam_role_policy_attachment.github_actions["iam"] will be created
+   resource "aws_iam_role_policy_attachment" "github_actions" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/IAMReadOnlyAccess"
+       role       = "brachio-dev-role-for-github-actions"
    }

  # module.ecs_backend.aws_iam_role_policy_attachment.task_execution_role["ecs"] will be created
+   resource "aws_iam_role_policy_attachment" "task_execution_role" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "brachio-dev-task-execution-role"
    }

  # module.ecs_backend.aws_iam_role_policy_attachment.task_execution_role["secretsmanager"] will be created
+   resource "aws_iam_role_policy_attachment" "task_execution_role" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "brachio-dev-task-execution-role"
    }

  # module.ecs_backend.aws_service_discovery_service.backend will be created
+   resource "aws_service_discovery_service" "backend" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "brachio-dev-ecs-backend-service"
+       namespace_id  = (known after apply)
+       tags_all      = (known after apply)
+       type          = (known after apply)
    }

  # module.network.aws_internet_gateway.main will be created
+   resource "aws_internet_gateway" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "brachio-dev-igw"
        }
+       tags_all = {
+           "Name" = "brachio-dev-igw"
        }
+       vpc_id   = (known after apply)
    }

  # module.network.aws_route.public will be created
+   resource "aws_route" "public" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.network.aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "brachio-dev-rtb-public"
        }
+       tags_all         = {
+           "Name" = "brachio-dev-rtb-public"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.public["0"] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["1"] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.backend will be created
+   resource "aws_security_group" "backend" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "brachio-dev-sg-backend"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "brachio-dev-sg-backend"
        }
+       tags_all               = {
+           "Name" = "brachio-dev-sg-backend"
        }
+       vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group.ingress_alb will be created
+   resource "aws_security_group" "ingress_alb" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "brachio-dev-sg-ingress-alb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "brachio-dev-sg-ingress-alb"
        }
+       tags_all               = {
+           "Name" = "brachio-dev-sg-ingress-alb"
        }
+       vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group.management will be created
+   resource "aws_security_group" "management" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "brachio-dev-sg-management"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "brachio-dev-sg-management"
        }
+       tags_all               = {
+           "Name" = "brachio-dev-sg-management"
        }
+       vpc_id                 = (known after apply)
    }

  # module.network.aws_subnet.public_ingress["0"] will be created
+   resource "aws_subnet" "public_ingress" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "172.16.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "brachio-dev-subnet-public-1a"
        }
+       tags_all                                       = {
+           "Name" = "brachio-dev-subnet-public-1a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_ingress["1"] will be created
+   resource "aws_subnet" "public_ingress" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "172.16.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "brachio-dev-subnet-public-1c"
        }
+       tags_all                                       = {
+           "Name" = "brachio-dev-subnet-public-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "172.16.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "brachio-dev-vpc"
        }
+       tags_all                             = {
+           "Name" = "brachio-dev-vpc"
        }
    }

  # module.network.aws_vpc_security_group_egress_rule.backend will be created
+   resource "aws_vpc_security_group_egress_rule" "backend" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
    }

  # module.network.aws_vpc_security_group_egress_rule.ingress_alb will be created
+   resource "aws_vpc_security_group_egress_rule" "ingress_alb" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
    }

  # module.network.aws_vpc_security_group_egress_rule.management will be created
+   resource "aws_vpc_security_group_egress_rule" "management" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
    }

  # module.network.aws_vpc_security_group_ingress_rule.backend will be created
+   resource "aws_vpc_security_group_ingress_rule" "backend" {
+       arn                          = (known after apply)
+       from_port                    = 80
+       id                           = (known after apply)
+       ip_protocol                  = "tcp"
+       referenced_security_group_id = (known after apply)
+       security_group_id            = (known after apply)
+       security_group_rule_id       = (known after apply)
+       tags_all                     = {}
+       to_port                      = 80
    }

  # module.network.aws_vpc_security_group_ingress_rule.ingress_alb will be created
+   resource "aws_vpc_security_group_ingress_rule" "ingress_alb" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       from_port              = 80
+       id                     = (known after apply)
+       ip_protocol            = "tcp"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
+       to_port                = 80
    }

Plan: 39 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @yamato0211, Working Directory: ``